turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4c32/atdf/ATSAM4C32E_0.atdf
        <register caption="Region Hash Area Start Address Register" name="ICM_HASH" offset="0x34" rw="RW" size="4">
          <bitfield caption="Hash Area Start Address" mask="0xFFFFFF80" name="HASA"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 0" name="ICM_UIHVAL0" offset="0x38" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 1" name="ICM_UIHVAL1" offset="0x3C" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 2" name="ICM_UIHVAL2" offset="0x40" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 3" name="ICM_UIHVAL3" offset="0x44" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 4" name="ICM_UIHVAL4" offset="0x48" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 5" name="ICM_UIHVAL5" offset="0x4C" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 6" name="ICM_UIHVAL6" offset="0x50" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 7" name="ICM_UIHVAL7" offset="0x54" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
      </register-group>
      <value-group caption="" name="ICM_CFG__UALGO">
        <value caption="SHA1 algorithm processed" name="SHA1" value="0x0"/>
        <value caption="SHA256 algorithm processed" name="SHA256" value="0x1"/>
        <value caption="SHA224 algorithm processed" name="SHA224" value="0x4"/>
      </value-group>
      <value-group caption="" name="ICM_UASR__URAT">
        <value caption="Unspecified structure member set to one detected when the descriptor is loaded." name="UNSPEC_STRUCT_MEMBER" value="0x0"/>
        <value caption="ICM_CFG modified during active monitoring." name="ICM_CFG_MODIFIED" value="0x1"/>
        <value caption="ICM_DSCR modified during active monitoring." name="ICM_DSCR_MODIFIED" value="0x2"/>
        <value caption="ICM_HASH modified during active monitoring" name="ICM_HASH_MODIFIED" value="0x3"/>
        <value caption="Write-only register read access" name="READ_ACCESS" value="0x4"/>
      </value-group>
    </module>
    <module caption="Interprocessor Communication" name="IPC" version="11204A">
      <register-group name="IPC">
        <register caption="Interrupt Set Command Register" name="IPC_ISCR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Interrupt Set" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Set" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Set" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Set" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Set" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Set" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Set" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Set" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Set" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Set" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Set" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Set" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Set" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Set" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Set" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Set" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Set" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Set" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Set" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Set" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Set" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Set" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Set" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Set" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Set" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Set" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Set" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Set" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Set" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Set" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Set" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Set" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Clear Command Register" name="IPC_ICCR" offset="0x0004" rw="W" size="4">
          <bitfield caption="Interrupt Clear" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Clear" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Clear" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Clear" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Clear" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Clear" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Clear" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Clear" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Clear" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Clear" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Clear" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Clear" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Clear" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Clear" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Clear" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Clear" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Clear" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Clear" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Clear" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Clear" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Clear" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Clear" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Clear" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Clear" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Clear" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Clear" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Clear" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Clear" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Clear" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Clear" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Clear" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Clear" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Pending Register" name="IPC_IPR" offset="0x0008" rw="R" size="4">
          <bitfield caption="Interrupt Pending" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Pending" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Pending" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Pending" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Pending" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Pending" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Pending" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Pending" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Pending" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Pending" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Pending" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Pending" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Pending" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Pending" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Pending" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Pending" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Pending" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Pending" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Pending" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Pending" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Pending" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Pending" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Pending" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Pending" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Pending" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Pending" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Pending" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Pending" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Pending" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Pending" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Pending" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Pending" mask="0x80000000" name="IRQ31"/>
        </register>
