turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4c32/atdf/ATSAM4C32E_0.atdf
        <register caption="Host Pipe Clear Register (n = 0) 0" name="UOTGHS_HSTPIPICR0" offset="0x560" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Clear" mask="0x00000001" name="RXINIC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Clear" mask="0x00000002" name="TXOUTIC"/>
          <bitfield caption="Transmitted SETUP Interrupt Clear" mask="0x00000004" name="TXSTPIC"/>
          <bitfield caption="NAKed Interrupt Clear" mask="0x00000010" name="NAKEDIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="Received STALLed Interrupt Clear" mask="0x00000040" name="RXSTALLDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETIC"/>
        </register>
        <register caption="Host Pipe Clear Register (n = 0) 1" name="UOTGHS_HSTPIPICR1" offset="0x564" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Clear" mask="0x00000001" name="RXINIC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Clear" mask="0x00000002" name="TXOUTIC"/>
          <bitfield caption="Transmitted SETUP Interrupt Clear" mask="0x00000004" name="TXSTPIC"/>
          <bitfield caption="NAKed Interrupt Clear" mask="0x00000010" name="NAKEDIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="Received STALLed Interrupt Clear" mask="0x00000040" name="RXSTALLDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETIC"/>
        </register>
        <register caption="Host Pipe Clear Register (n = 0) 2" name="UOTGHS_HSTPIPICR2" offset="0x568" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Clear" mask="0x00000001" name="RXINIC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Clear" mask="0x00000002" name="TXOUTIC"/>
          <bitfield caption="Transmitted SETUP Interrupt Clear" mask="0x00000004" name="TXSTPIC"/>
          <bitfield caption="NAKed Interrupt Clear" mask="0x00000010" name="NAKEDIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="Received STALLed Interrupt Clear" mask="0x00000040" name="RXSTALLDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETIC"/>
        </register>
        <register caption="Host Pipe Clear Register (n = 0) 3" name="UOTGHS_HSTPIPICR3" offset="0x56C" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Clear" mask="0x00000001" name="RXINIC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Clear" mask="0x00000002" name="TXOUTIC"/>
          <bitfield caption="Transmitted SETUP Interrupt Clear" mask="0x00000004" name="TXSTPIC"/>
          <bitfield caption="NAKed Interrupt Clear" mask="0x00000010" name="NAKEDIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="Received STALLed Interrupt Clear" mask="0x00000040" name="RXSTALLDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETIC"/>
        </register>
        <register caption="Host Pipe Clear Register (n = 0) 4" name="UOTGHS_HSTPIPICR4" offset="0x570" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Clear" mask="0x00000001" name="RXINIC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Clear" mask="0x00000002" name="TXOUTIC"/>
          <bitfield caption="Transmitted SETUP Interrupt Clear" mask="0x00000004" name="TXSTPIC"/>
          <bitfield caption="NAKed Interrupt Clear" mask="0x00000010" name="NAKEDIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="Received STALLed Interrupt Clear" mask="0x00000040" name="RXSTALLDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETIC"/>
        </register>
        <register caption="Host Pipe Set Register (n = 0) 0" name="UOTGHS_HSTPIPIFR0" offset="0x590" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Set" mask="0x00000001" name="RXINIS"/>
          <bitfield caption="Transmitted OUT Data Interrupt Set" mask="0x00000002" name="TXOUTIS"/>
          <bitfield caption="Transmitted SETUP Interrupt Set" mask="0x00000004" name="TXSTPIS"/>
          <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
          <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="Received STALLed Interrupt Set" mask="0x00000040" name="RXSTALLDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETIS"/>
          <bitfield caption="Number of Busy Banks Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Host Pipe Set Register (n = 0) 1" name="UOTGHS_HSTPIPIFR1" offset="0x594" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Set" mask="0x00000001" name="RXINIS"/>
          <bitfield caption="Transmitted OUT Data Interrupt Set" mask="0x00000002" name="TXOUTIS"/>
          <bitfield caption="Transmitted SETUP Interrupt Set" mask="0x00000004" name="TXSTPIS"/>
          <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
          <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="Received STALLed Interrupt Set" mask="0x00000040" name="RXSTALLDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETIS"/>
          <bitfield caption="Number of Busy Banks Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Host Pipe Set Register (n = 0) 2" name="UOTGHS_HSTPIPIFR2" offset="0x598" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Set" mask="0x00000001" name="RXINIS"/>
          <bitfield caption="Transmitted OUT Data Interrupt Set" mask="0x00000002" name="TXOUTIS"/>
          <bitfield caption="Transmitted SETUP Interrupt Set" mask="0x00000004" name="TXSTPIS"/>
          <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
          <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="Received STALLed Interrupt Set" mask="0x00000040" name="RXSTALLDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETIS"/>
          <bitfield caption="Number of Busy Banks Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Host Pipe Set Register (n = 0) 3" name="UOTGHS_HSTPIPIFR3" offset="0x59C" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Set" mask="0x00000001" name="RXINIS"/>
          <bitfield caption="Transmitted OUT Data Interrupt Set" mask="0x00000002" name="TXOUTIS"/>
          <bitfield caption="Transmitted SETUP Interrupt Set" mask="0x00000004" name="TXSTPIS"/>
          <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
          <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="Received STALLed Interrupt Set" mask="0x00000040" name="RXSTALLDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETIS"/>
          <bitfield caption="Number of Busy Banks Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Host Pipe Set Register (n = 0) 4" name="UOTGHS_HSTPIPIFR4" offset="0x5A0" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Set" mask="0x00000001" name="RXINIS"/>
          <bitfield caption="Transmitted OUT Data Interrupt Set" mask="0x00000002" name="TXOUTIS"/>
          <bitfield caption="Transmitted SETUP Interrupt Set" mask="0x00000004" name="TXSTPIS"/>
          <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
          <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="Received STALLed Interrupt Set" mask="0x00000040" name="RXSTALLDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETIS"/>
          <bitfield caption="Number of Busy Banks Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 0" name="UOTGHS_HSTPIPIMR0" offset="0x5C0" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
